<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame对象的列操作" data-toc-modified-id="DataFrame对象的列操作-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame对象的列操作</a></span><ul class="toc-item"><li><span><a href="#增加列" data-toc-modified-id="增加列-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>增加列</a></span></li><li><span><a href="#删除列" data-toc-modified-id="删除列-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>删除列</a></span><ul class="toc-item"><li><span><a href="#del-df[要删除的列名]" data-toc-modified-id="del-df[要删除的列名]-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>del df[要删除的列名]</a></span></li><li><span><a href="#df.pop(要删除的列名)" data-toc-modified-id="df.pop(要删除的列名)-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>df.pop(要删除的列名)</a></span></li><li><span><a href="#df.drop(coumns=要删除的列名)" data-toc-modified-id="df.drop(coumns=要删除的列名)-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>df.drop(coumns=要删除的列名)</a></span></li></ul></li><li><span><a href="#修改列" data-toc-modified-id="修改列-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>修改列</a></span><ul class="toc-item"><li><span><a href="#修改列的值-df[要修改的列]-=-新值" data-toc-modified-id="修改列的值-df[要修改的列]-=-新值-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>修改列的值 df[要修改的列] = 新值</a></span></li><li><span><a href="#修改列的名" data-toc-modified-id="修改列的名-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>修改列的名</a></span><ul class="toc-item"><li><span><a href="#df.columns-=--包含新列名的列表" data-toc-modified-id="df.columns-=--包含新列名的列表-1.3.2.1"><span class="toc-item-num">1.3.2.1&nbsp;&nbsp;</span>df.columns =  包含新列名的列表</a></span></li><li><span><a href="#df.rename()" data-toc-modified-id="df.rename()-1.3.2.2"><span class="toc-item-num">1.3.2.2&nbsp;&nbsp;</span>df.rename()</a></span></li></ul></li></ul></li><li><span><a href="#移动列" data-toc-modified-id="移动列-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>移动列</a></span><ul class="toc-item"><li><span><a href="#df.insert(要插入的索引位置,-列名，-该列的值)" data-toc-modified-id="df.insert(要插入的索引位置,-列名，-该列的值)-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>df.insert(要插入的索引位置, 列名， 该列的值)</a></span></li></ul></li></ul></li></ul></div>

In [219]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [220]:
import numpy as np
import pandas as pd

# DataFrame对象的列操作

In [221]:
df = pd.DataFrame({'员工姓名':['小明', '小李', '小红'], 
                     '基本工资':[3500, 4000, 4500], 
                     '销售业绩':[8000, 12000, 6000]})
df

  员工姓名  基本工资   销售业绩
0   小明  3500   8000
1   小李  4000  12000
2   小红  4500   6000

## 增加列  
比如我们增加一列 **销售提成**， 提成是销售业绩的5个点， 也是5%

In [222]:
df.销售业绩  # 这样可以单独提取出一列， 单独的一个是Series结构

0     8000
1    12000
2     6000
Name: 销售业绩, dtype: int64

In [223]:
df.销售业绩*0.05

0    400.0
1    600.0
2    300.0
Name: 销售业绩, dtype: float64

In [224]:
df['销售提成'] = df.销售业绩*0.05

In [225]:
df

  员工姓名  基本工资   销售业绩   销售提成
0   小明  3500   8000  400.0
1   小李  4000  12000  600.0
2   小红  4500   6000  300.0

再创建一列 **应发工资** = 基本工资+销售提成

In [226]:
df['应发工资'] = df.基本工资+df.销售提成

In [227]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资
0   小明  3500   8000  400.0  3900.0
1   小李  4000  12000  600.0  4600.0
2   小红  4500   6000  300.0  4800.0

增加一列， **出勤天数**  
小明 24  
小李 22   
小红 23

In [228]:
df['出勤天数'] = [24, 22, 23]

In [229]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

## 删除列

### del df[要删除的列名]  
会直接在原数据上修改

In [230]:
df['a'] = [1, 2, 3]
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  a
0   小明  3500   8000  400.0  3900.0    24  1
1   小李  4000  12000  600.0  4600.0    22  2
2   小红  4500   6000  300.0  4800.0    23  3

In [231]:
del df['a']  # 直接在原表上进行删除

In [232]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

### df.pop(要删除的列名)  
直接会在原表上删除该列， 并会以Series返回该列

In [233]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

In [234]:
df['A'] = 3  # 如果是一个标量会自动全部用这个标量填充

In [235]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  A
0   小明  3500   8000  400.0  3900.0    24  3
1   小李  4000  12000  600.0  4600.0    22  3
2   小红  4500   6000  300.0  4800.0    23  3

In [236]:
df.pop('A')  # 直接会在原表上删除该列， 并会以Series返回该列

0    3
1    3
2    3
Name: A, dtype: int64

In [237]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

### df.drop(coumns=要删除的列名)

In [238]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

In [239]:
df['a1'] = [1, 2, 3]
df['a2'] = [4, 5, 6]
df['a3'] = [7, 8, 9]
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  a1  a2  a3
0   小明  3500   8000  400.0  3900.0    24   1   4   7
1   小李  4000  12000  600.0  4600.0    22   2   5   8
2   小红  4500   6000  300.0  4800.0    23   3   6   9

In [240]:
df.drop(columns = 'a1')  #直接这样会返回新的表， 不会改变原来的表

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  a2  a3
0   小明  3500   8000  400.0  3900.0    24   4   7
1   小李  4000  12000  600.0  4600.0    22   5   8
2   小红  4500   6000  300.0  4800.0    23   6   9

In [241]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  a1  a2  a3
0   小明  3500   8000  400.0  3900.0    24   1   4   7
1   小李  4000  12000  600.0  4600.0    22   2   5   8
2   小红  4500   6000  300.0  4800.0    23   3   6   9

In [242]:
df.drop(columns = 'a1', inplace = True)

In [243]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数  a2  a3
0   小明  3500   8000  400.0  3900.0    24   4   7
1   小李  4000  12000  600.0  4600.0    22   5   8
2   小红  4500   6000  300.0  4800.0    23   6   9

In [244]:
df.drop(columns = ['a2', 'a3'], inplace = True)  # 删除多列就给columns传入一个包含列名的列表

In [245]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

## 修改列

### 修改列的值 df[要修改的列] = 新值

In [246]:
df

  员工姓名  基本工资   销售业绩   销售提成    应发工资  出勤天数
0   小明  3500   8000  400.0  3900.0    24
1   小李  4000  12000  600.0  4600.0    22
2   小红  4500   6000  300.0  4800.0    23

**比如， 现在老板把业绩的提成从5%升到10%**

In [247]:
df['销售提成'] = df.销售业绩*0.1

In [248]:
df

  员工姓名  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  3500   8000   800.0  3900.0    24
1   小李  4000  12000  1200.0  4600.0    22
2   小红  4500   6000   600.0  4800.0    23

### 修改列的名

#### df.columns =  包含新列名的列表
修改全部列的名字

In [249]:
df1 = df.copy()
df1

  员工姓名  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  3500   8000   800.0  3900.0    24
1   小李  4000  12000  1200.0  4600.0    22
2   小红  4500   6000   600.0  4800.0    23

In [250]:
df1.columns = ['a', 'b', 'c', 'd', 'e', 'f']   # 直接在原列表上修改

In [251]:
df1

    a     b      c       d       e   f
0  小明  3500   8000   800.0  3900.0  24
1  小李  4000  12000  1200.0  4600.0  22
2  小红  4500   6000   600.0  4800.0  23

#### df.rename()   
单独修改某些列的名字

In [260]:
df2 = df.copy()
df2

  员工姓名  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  3500   8000   800.0  3900.0    24
1   小李  4000  12000  1200.0  4600.0    22
2   小红  4500   6000   600.0  4800.0    23

比如把**应发工资**改变成**实发工资**

In [261]:
df2.rename(columns = {'应发工资':'实发工资'}, inplace=True)

In [262]:
df2

  员工姓名  基本工资   销售业绩    销售提成    实发工资  出勤天数
0   小明  3500   8000   800.0  3900.0    24
1   小李  4000  12000  1200.0  4600.0    22
2   小红  4500   6000   600.0  4800.0    23

## 移动列

### df.insert(要插入的索引位置, 列名， 该列的值)

In [274]:
df3 = df.copy()
df3

  员工姓名  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  3500   8000   800.0  3900.0    24
1   小李  4000  12000  1200.0  4600.0    22
2   小红  4500   6000   600.0  4800.0    23

先新增一列   性别

In [275]:
df3['性别'] = ['男', '男', '女']

In [276]:
df3

  员工姓名  基本工资   销售业绩    销售提成    应发工资  出勤天数 性别
0   小明  3500   8000   800.0  3900.0    24  男
1   小李  4000  12000  1200.0  4600.0    22  男
2   小红  4500   6000   600.0  4800.0    23  女

In [277]:
df3.insert(1,  '性别', df3.pop('性别'))

In [278]:
df3

  员工姓名 性别  基本工资   销售业绩    销售提成    应发工资  出勤天数
0   小明  男  3500   8000   800.0  3900.0    24
1   小李  男  4000  12000  1200.0  4600.0    22
2   小红  女  4500   6000   600.0  4800.0    23

可以通过这种方式来移动列